data = '{
	"idea":[
		{
			"title": "Water Level Controller using Mictrocontroller",
			"description": "This project monitors the water level of the tank and automatically switches on the pump motor when ever tank is empty. The motor is switched off automatically when container or overhead tank is full. The main principle used in this project is “water conducts electricity”. In this project water level of the overhead tank is indicated on a 16*2 LCD. In this system a set of 4 wires which are placed at different water levels can be used to sense the water levels. Based on the outputs of these wires controller displays the water level as well as controls the pump motor. For more information about this project",
			"category": "Embedded Systems",
			"picture": "http://www.electronicshub.org/wp-content/uploads/2014/06/Circuit-Diagram-of-Water-Level-Controller-using-8051-Microcontroller.jpg",
			"share_check": "Y",
			"implementation": "",
			"diffculty": "4",
			"comments": [
				{
					"user_id": "joe_smith",
					"comment": "This project seems extremely hard - requires a lot of knowledge about microcontrollers"
				}
			]
		},
		{
			"title": "Automated Maze Solver",
			"description": "Given a maze in a text file, solve the maze using machine learning algorithm of choice in the most efficient manor",
			"category": "Machine Learning",
			"picture": "https://www.google.com/url?sa=i&rct=j&q=&esrc=s&source=images&cd=&ved=0ahUKEwi-tPnauubNAhXi6YMKHX6pBnAQjBwIBA&url=http%3A%2F%2Fapi.ning.com%2Ffiles%2FIDNSaKSVW-J125OC357ZDVxSd5CCVybIGkEGUcADwTaYL292kpp4UjIlp8fp3BbzXTEZCgdg6n1ymV1TfZ*nj8UpDAGrnFOf%2FMachineLearning01.png&psig=AFQjCNFYZb5oQHdc5aJuxONCzCmIO-_XhA&ust=1468156336625282",
			"share_check": "Y",
			"implementation": "I would recommend using neural networks",
			"diffculty": "3",
			"comments": [
			]
		},
		{
			"title": "Student Record Keeping System Database",
			"description": "Design goals: a student file that contains the information about student, a stream file, a marks file, a fee file, concession/scholarship etc",
			"category": "Databases",
			"picture": "",
			"share_check": "Y",
			"implementation": "You can google for samples of partly done databases",
			"diffculty": "2",
			"comments": [
			]
		},
		{
			"title": "Railway System Database",
			"description": "A railway system, which needs to model the following:
				 Stations
				 Tracks, connecting stations. You can assume for simplicity that only one track exists between any two stations. All the tracks put together form a graph.
				 Trains, with an ID and a name
				 Train schedules recording what time a train passes through each station on its route. 
				You can assume for simplicity that each train reaches its destination on the same day, and that every train runs every day. Also for simplicity, assume that for each train, for each station on its route,  you store
				 Time in, 
				 Time out (same as time in if it does not stop)
				 A sequence number so the stations in the route of a train can be ordered by sequence number.
				 Passenger booking consisting of train, date, from-station, to-station, coach, seat and passenger name.",
			"category": "Databases",
			"picture": "http://lazyprogrammer.me/wp-content/uploads/2015/12/Database_iStock_000020783950XSmall_0.jpg",
			"share_check": "Y",
			"implementation": "",
			"diffculty": "4",
			"comments": [
			]
		},
		{
			"title": "Beetcoin",
			"description": "Mobile app that acts as a nice UI on top of various Bitcoin exchanges. It should be possible to view pending trades, get current bid/ask prices and place new trades.",
			"category": "Mobile App",
			"picture": "",
			"share_check": "Y",
			"implementation": "You can look at web sites regarding Bitcoin that show status of the value",
			"diffculty": "3",
			"comments": [
			]
		},
		{
			"title": "Hacker News Directory",
			"description": "List all Hacker News related services, websites, Chrome extensions, publications, apps, etc. There is currently no such official website.",
			"category": "Website",
			"picture": "http://www.frecosse.com/images/slider/website_design.png",
			"share_check": "Y",
			"implementation": "",
			"diffculty": "1",
			"comments": [
				{
					"user_id": "steve",
					"comment": "You should look at using pre-existing APIs for this"
				}
			]
		},
		{
			"title": "Instant UML Diagram for a Given Github Repository",
			"description": "I’ve always wanted something like this. Select a given Github repository and instantly get an UML class diagram, whatever the language is. UML is not really a good fit for more dynamical languages but nowadays there are statical analysis tools even for Javascript and company.",
			"category": "Website",
			"picture": "",
			"share_check": "Y",
			"implementation": "",
			"diffculty": "4",
			"comments": [
				{
					"user_id": "matt_j",
					"comment": "This would be a really neat project"
				},
				{
					"user_id": "jeff_r",
					"comment": "I would use this if it were implemented - keep me updated!"
				}
			]
		},
		{
			"title": "Self Sculpture",
			"description": "Create a sculpture of another person",
			"category": "Art",
			"picture": "",
			"share_check": "Y",
			"implementation": "",
			"diffculty": "4",
			"comments": [
			]
		},
		{
			"title": "Workaholics Paper",
			"description": "Do Americans work too hard? Does working more actually reduce productivity? Is a 40-hour workweek too much? Should there be a mandatory cap on the number of hours a person can work? Should there be changes in employment laws to give Americans more relaxation time?",
			"category": "Research Paper",
			"picture": "",
			"share_check": "Y",
			"implementation": "",
			"diffculty": "2",
			"comments": [
			]
		},
		{
			"title": "Censorship Paper",
			"description": "Should parents censor textbooks and other literature for children in schools?",
			"category": "Research Paper",
			"picture": "",
			"share_check": "Y",
			"implementation": "",
			"diffculty": "1",
			"comments": [
			]
		}
	],
	"user":[
		{
			"user_id":"matt",
			"pwd":"matt"
		}
	]
}''